soap-samples/square-request.xml


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:shape="http://wuniversity.edu/se/shapetool">
   <soapenv:Header/>
   <soapenv:Body>
      <shape:SquareAreaRequest>
         <shape:side>5.0</shape:side>
      </shape:SquareAreaRequest>
   </soapenv:Body>
</soapenv:Envelope>